# Робота з рядком


def string(s):
    return print('- третій символ рядка: ', s[2],
                 '\n- передостанній символ рядка: ', s[-2],
                 '\n- перші 5 символів рядка: ', s[0:5],
                 '\n- весь рядок, крім 2х останніх: ', s[0:-2],
                 '\n- усі символи з парними індексами: ', s[::2],
                 '\n- усі символи з непарними індексами: ', s[1::2],
                 '\n- усі символи в зворотньому порядку: ', s[::-1],
                 '\n- усі символи через 1 в зворотньому порядку: ', s[::-2],
                 '\n- довжина рядка: ', len(s),)


s = str(input('Введіть рядок: ', ))
print(string(s))
